<HTML>  
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 3.0 Mac">
  <TITLE>MidiShare LAN Driver</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff">

<H1><CENTER><FONT COLOR="#0000ff" FACE="Arial"><IMG SRC="../images/msLAN.jpeg"
WIDTH="169" HEIGHT="178" ALIGN="BOTTOM" BORDER="0" NATURALSIZEFLAG="3"></FONT></CENTER></H1>

<P><FONT FACE="Arial">Le driver LAN - MidiShare permet la communication
temps r&eacute;el sur un r&eacute;seau avec un temps de latence
faible. Cette communication est restreinte &agrave; un r&eacute;seau
local. L'optimisation du protocole suppose que le r&eacute;seau
est principalement d&eacute;di&eacute; &agrave; des transmissions
musicales.</FONT></P>

<P><FONT FACE="Arial">Le driver LAN - MidiShare est dormant tant
qu'il n'y a pas d'application cliente MidiShare ouverte. Dans
l'&eacute;tat dormant, la machine ne sera pas visible par les
autres machines sur le r&eacute;seau. Le driver se r&eacute;veille
lors de l'ouverture de la premi&egrave;re application cliente
de MidiShare.</FONT></P>

<P><FONT FACE="Arial">Dans sa phase de r&eacute;veil, le driver
reconnait automatiquement les machines distantes sur le r&eacute;seau
(sous r&eacute;serve que leurs drivers ne sont pas dans l'&eacute;tat
dormant). Les machines distantes apparaissent comme des ports
MidiShare en mode Driver, ou comme des clients MidiShare dans
le cas contraire (voir <A HREF="INetDrivers.html#setupMenu">Setup
Menu</A>).</FONT></P>

<H3><FONT FACE="Arial">Les m&eacute;canismes de la transmission
temps r&eacute;&eacute;el :</FONT></H3>

<BLOCKQUOTE>
  <P><FONT FACE="Arial">La transmission en temps r&eacute;el d'un
  flot d'&eacute;v&eacute;nements MidiShare est bas&eacute;e sur
  2 m&eacute;canismes :</FONT></P>
  <UL>
    <LI><FONT FACE="Arial">une p&eacute;riode de groupage : c'est
    la p&eacute;riode pendant laquelle les &eacute;v&eacute;nements
    sont accumul&eacute;s avant d'&ecirc;tre transmis sur le r&eacute;seau.
    Elle permet d'optimiser l'utilisation du r&eacute;seau. Ce param&egrave;tre
    controle le comportement du driver &agrave; l'&eacute;mission.</FONT>
    <LI><FONT FACE="Arial">un temps de latence maximal : il repr&eacute;sente
    le temps de transmission maximum (de l'&eacute;metteur au r&eacute;cepteur)
    autoris&eacute; pour garantir une restitution temporelle correcte
    des &eacute;v&eacute;nements transmis. Il permet de compenser
    la latence du r&eacute;seau et les variations du temps de transmission.
    Ce param&egrave;tre controle le comportement du driver &agrave;
    la r&eacute;ception.</FONT>
  </UL>
  <P><FONT FACE="Arial">Le d&eacute;lai total introduit par la
  transmission sur le r&eacute;seau est &eacute;gal &agrave; la
  p&eacute;riode de groupage + le temps de latence maximal.</FONT></P>
  <P><FONT FACE="Arial">Ces param&egrave;tres peuvent &ecirc;tre
  ajust&eacute;s en r&eacute;glant les pr&eacute;f&eacute;rences
  UDP (voir Setup Menu).</FONT></P>
  <P><CENTER><FONT FACE="Arial"><IMG SRC="../images/udpLAN.gif"
  WIDTH="242" HEIGHT="119" ALIGN="BOTTOM" BORDER="0" NATURALSIZEFLAG="3"><BR>
  </FONT><FONT SIZE="-1" FACE="Arial">UDP Preferences</FONT></CENTER></P>
  <P><FONT FACE="Arial">Les valeurs par d&eacute;faut sont de 10
  milliseconds pour le temps de latence maximal et de 10 milliseconds
  pour la p&eacute;riode de groupage.</FONT></P>
  <P><FONT FACE="Arial">Le num&eacute;ro de port correspond au
  num&eacute;ro de port UDP. L'utilisation de num&eacute;ros de
  ports diff&eacute;rents permet de constituer es sous-r&eacute;seaux
  diff&eacute;rents sur un m&ecirc;me r&eacute;seau local.</FONT></P></BLOCKQUOTE>

<P><HR ALIGN=LEFT></P>

<P><FONT FACE="Arial">Le driver LAN - MidiShare fait partie du
projet <A HREF="http://www.grame.fr/MidiShare/fr" TARGET="_top">MidiShare</A>.
Ils a &eacute;t&eacute; d&eacute;velopp&eacute; par le <A HREF="http://www.grame.fr/Research/fr"
TARGET="_top">laboratoire de recherche en informatique musicale</A>
de <A HREF="http://www.grame.fr/" TARGET="_blank">Grame</A>, en
collaboration avec la soci&eacute;t&eacute; <A HREF="http://www.milprod.com/"
TARGET="_blank">Mil-Productions</A>.</FONT>

</BODY>
</HTML>
